import React from 'react';
import styles from './policy.module.css';

function Policy() {
  return (
    <div className={styles.policyWrapper}>
      <h2>Политика конфиденциальности</h2>
      <p>1. Предоставление информации Пользователем:</p>

      <p>1.1. При регистрации в качестве нового пользователя, использовании формы обратной связи, отправке комментариев на сайте ogorod.ru (далее - "Сайт") Пользователь соглашается предоставить следующую информацию:</p>

      <p>Имя, логин, пароль, адрес электронной почты, IP адрес, пол, дату рождения, адрес аватара (основной картинки) и другие общедоступные данные.</p>

      <p>1.2. Предоставляя свои персональные данные Пользователь соглашается на их обработку (вплоть до отзыва Пользователем своего согласия на обработку его персональных данных) в целях исполнения владельцем Сайта (далее - "Владелец") своих обязательств перед Пользователем, предоставления справочной информации. Пользователь также соглашается на получение сообщений рекламно-информационного характера и сервисных сообщений. При обработке персональных данных Пользователя Владелец руководствуется Федеральным законом "О персональных данных", Федеральным законом "О рекламе" и локальными нормативными документами.</p>

      <p>1.2.1. Если Пользователь желает уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, либо в случае желания Пользователя отозвать свое согласие на обработку персональных данных или устранения неправомерных действий в отношении его персональных данных, он должен направить официальный запрос Владельцу.</p>

      <p>Если Пользователь желает удалить свою учетную запись на Сайте, он может обратиться к Владельцу через форму обратной связи на странице «Контакты» с соответствующей просьбой.</p>

      <p>1.3. Использование информации, предоставленной Пользователем и получаемой Владельцем.</p>

      <p>1.3.1 Владелец использует предоставленные Пользователем данные в течение всего срока регистрации Пользователя на Сайте в целях:</p>

      <p>регистрации/авторизации Пользователя на Сайте;</p>
      <p>оценки и анализа работы Сайта.</p>
      <p>2. Предоставление и передача информации, полученной Владельцем:</p>

      <p>2.1. Владелец обязуется не передавать полученную от Пользователя информацию третьим лицам.</p>

      <p>2.2. Не считается нарушением обязательств передача информации в соответствии с обоснованными и применимыми требованиями законодательства Российской Федерации.</p>

      <p>2.3. Владелец вправе использовать технологию "cookies". "Cookies" не содержат конфиденциальную информацию и не передаются третьим лицам.</p>

      <p>2.5. Владелец не несет ответственности за сведения, предоставленные Пользователем на Сайте в общедоступной форме.</p>

      <p>3. Хранение и использование информации Пользователем</p>

      <p>3.1. Пользователь обязуется не сообщать третьим лицам логин и пароль, используемые им для идентификации на Сайте.</p>

      <p>3.2. Пользователь обязуется обеспечить должную осмотрительность при хранении и использовании логина и пароля (в том числе, но не ограничиваясь: использовать лицензионные антивирусные программы, использовать сложные буквенно-цифровые сочетания при создании пароля, не предоставлять в распоряжение третьих лиц компьютер или иное оборудование с введенными на нем логином и паролем Пользователя и т.п.)</p>

      <p>3.3. В случае возникновения у Владельца подозрений относительно использования учетной записи Пользователя третьим лицом или вредоносным программным обеспечением Владелец вправе в одностороннем порядке изменить пароль Пользователя или удалить все данные о Пользователе из базы данных.</p>

      <p>3.4. Как Пользователь вы согласны с тем, что введённая вами информация будет храниться в базе данных. Хотя эта информация не будет открыта третьим лицам без вашего разрешения, Владелец не может быть ответственен за действия хакеров, которые могут привести к несанкционированному доступу к ней.</p>
    </div>
  )
}

export default Policy;